---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.PathReinforcementWrongHost
source: html/4f0755cc-9577-46be-6855-49c81f91f5fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.PathReinforcementWrongHost Property

Path Reinforcement can be placed only in Structural Floors and straight Structural Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathReinforcementWrongHost { get; }
```